/*
 *
 *  Name: Control_Binarization.c
 *  Created on: 2025/2/28
 *  Author: Magneto
 *
 */
#include "zf_common_headfile.h"

 //==================================================== 电机PID ====================================================
leftpid LeftPID = {
    .L_SetSpeed = 0,    // 目标速度初始化为 0
    .L_RealSpeed = 0,   // 实际速度初始化为 0
    .L_Mkp = 100,       // 比例系数初始化为 620
    .L_Mki = 20,        // 积分系数初始化为 37
    .L_Merror = 0,      // 当前误差初始化为 0
    .L_Merror1 = 0,     // 上一次误差初始化为 0
    .L_PiOut = 0        // PI控制器输出初始化为 0
};

rightpid RightPID = {
    .R_SetSpeed = 0,    // 目标速度初始化为 0
    .R_RealSpeed = 0,   // 实际速度初始化为 0
    .R_Mkp = 100,       // 比例系数初始化为 620
    .R_Mki = 20,        // 积分系数初始化为 37
    .R_Merror = 0,      // 当前误差初始化为 0
    .R_Merror1 = 0,     // 上一次误差初始化为 0
    .R_PiOut = 0        // PI控制器输出初始化为 0
};
//==================================================== 电机PID ====================================================

//==================================================== 舵机PID ====================================================
uint16 Servo_Duty = 785;              // 初始占空比
// 速度环转向减速
skperror TrunReduce = {
    .error = 0,                       // 当前误差
    .error_last = 0,                  // 上一次误差
    .out = 0                          // 输出
};
SERVO_PID_PARAMETERS Servo_pid_t;
SERVO_CONTROL Servo_t;
//==================================================== 舵机PID ====================================================
